import { removeTabsAndSpaces } from "@/lib/utils"

export type InnerPageKeys = "about-me" | "get-started" | "culture"

export interface InnerPage {
  id: InnerPageKeys
  title: string
  href: string
  img: string
  subtitle: string
  text: string
}

export const innerPagesConfig: InnerPage[] = [
  {
    id: "about-me",
    title: "על עצמי",
    subtitle: `"אתה תמיד צריך להיות מוכן לכל סיטואציה,
    אבל אף פעם לא להתכונן אליה."`,
    href: "/about-me",
    img: "https://res.cloudinary.com/dsperrtyj/image/upload/v1690536019/movement-guy/12_arcmcp.webp",
    text: removeTabsAndSpaces(`המסע התנועתי שלי התחיל בתור ילד שגיליתי את האושר שבכדורסל.
    המשחק היה כמו קנבס ליצירתיות בשבילי ואני נהניתי מאינסוף האפשרויות שהמשחק מציע.
    כשהשנים עברו, והתגייסתי לצבא.
     הייתי צריך לזנוח את המשחק שכה אהבתי ולשים את הגוף שלי במסגרת לחצים שונה.
    הגוף שלי לא הגיב לכך בצורה טובה, סיימתי את השירות הצבאי שלי פצוע, חולה, כבד משקל ואפילו לא יודע איפה אפשר להתחיל כדי לתקן את העוול.
    ושם, בנקודה השחורה ביותר, התגלה בפניי התרגול התנועתי.
    בהתחלה התרגול תפס את המקום של- שיקום, חיזוק וירידה במשקל.
    ואכן כך קרה, הפציעות שלי אט אט דעכו, תחושות ערנות וחיות שלא הרגשתי מעולם התחילו להתפתח, ירדתי במשקל ויותר חשוב מכך, הסקרנות שלי עלתה על גדותיה.
    הכל היה כ"כ מעניין, כל תרגיל, כל תנועה, פתאום הכל קיבל תפנית- הגוף שלי הפך להיות הדבר הכי מרגש ומעניין שאני יכול לעלות בראשי, הרמת עומק ומורכבות שהוא מחזיק בתוכו, היא אינסופית, ואני רציתי ללמוד עליו, כמה שיותר.
    במהלך השנים התרגול והמחקר התפתח ועם זה הגיעה ההבנה שזה לא משחק הכדורסל שהביא לי הנאה, אלא תנועה שהביאה לי אושר והציתה בי תשוקה.
    תנועה הפכה למקור אמיתי של סיפוק והגשמה והיא פתחה לי דלתות לחקור עולמות תרגול שונים- אני יכול לעשות קורס מדריכי חדר כושר, בו זמנית לחקור ריקוד, לצלול לתוך עמידות ידיים/איזון, ללמוד קפוארה, הוראה, ג'וג'יטסו, ללמוד על כאב, טראומה, טיפול, אקרובטיקה, יוגה. 
    הידיעה שתחת המטרייה התנועתית אני אוכל להיות כל הדברים הללו, ובו זמנית לא להיות אף אחד מהם, נפלה עליי יום אחד.
     כולם היו נגישים לי בצלחת, ואני נהניתי ועדיין נהנה מלאכול מהצלחת הזו כל יום מחדש.
    ההבנה החדשה הזו פתחה בפניי מסע טרנספורמטיבי של תנועה ככלי לצמיחה וגילוי עצמי.
    המסע שלי ממשיך, בין אם זה ללמד אנשים מכל טווחי הגילאים, ילדים ומבוגרים כאחד-מה היא תנועה, מה המקום שלה בחייהם, ואיך היא עוזרת לנו למצוא את האינדיבידואל שבתוכנו או בין אם זה בתרגול האישי שלי, שממשיך להתפתח יום יום.
    כל מה שעליי לעשות הוא להשאיר את עצמי פתוח- פתוח לגלות את הפוטנציאל האינסופי שתנועה טומנת בתוכה.
    `),
  },
  {
    id: "culture",
    title: "מהי תנועה",
    subtitle: `"מסע אישי, שמתאים לכולם"`,
    href: "/culture",
    img: "https://res.cloudinary.com/dsperrtyj/image/upload/v1690536024/movement-guy/9_eibprm.webp",
    text: removeTabsAndSpaces(`בעידן שלנו, תנועה התעלתה מרק אימון פיזי, זו פילוסופיה איתנה ודינאמית שמצביעה לנו על דרך אחרת לחיות את חיינו.
    התרגול התנועתי איננו במסגרות השיעור, הוא מנסה לשבור את המסגרות האלה, להעניק חיים וחיות לכל שאר האספקטים של החיים.
    ללמד את האינדיבידואל דרך סיטואציות תנועתיות, איך הוא פועל בעולמינו, מה הם הדפוסים שלו, והרעיונות שלו. תנועה מעניקה את הבחירה איך אנחנו רוצים להתקיים.
    התרגול שלנו איננו סטטי, אנחנו לא מאמינים ב"תבניות אימון בסיסיות", או בתוכנית "חודשיים ראשונים" הוא דינאמי בהתאם לאינדיבידואל.
    כל אדם מקבל בהתאם למה שהוא מביא אתו, לכן כולם מוזמנים לתרגל תנועה, כי היא לא מוגבלת ברמה, גיל, מבנה גוף, מצב רפואי וכו', התרגול הוא בשביל כולם.
    המסע הוא אמנם אישי, אך הוא לא יוכל להתקיים ללא האנשים שיוסיפו גיוון, יאתגרו, יגרו, ויכילו.
    תחת התרגול התנועתי כל סגנונות האימון מתאחדים- אומנויות לחימה, פארקור, ריקוד, משחקי ספורט, אקרובטיקה, פיתוח כוח, כל הסגנונות מתקבלים בברכה, כי לכל אדם מתאים סגנון.
    כולם חולקים רעיונות, ניסיון עבר, ומסע משותף של גילוי עצמי, אנחנו מאמצים רוח סקרנית, שמגייסת אנשים ללמוד אחד מהשני-להרחיב אופקים יחד. כולם מתאחדים תחת מטריית התנועה.
    אז אם עליי לסכם מה הוא תרגול תנועה- הוא המסע לצלול פנימה, דרך הגוף, ביחד עם קהילה תומכת.`),
  },
  {
    id: "get-started",
    title: "איפה מתחילים",
    subtitle: `"מתחילים באינדיבידואל"`,
    href: "/get-started",
    img: "https://res.cloudinary.com/dsperrtyj/image/upload/v1690536027/movement-guy/16_hesfd7.webp",
    text: removeTabsAndSpaces(`מתחילים מאימון כוח? מתחילים מהעמוד שדרה? החלמת פציעות?החלומות הכי פרועים שלנו? מבודדים ואז מחברים? מה עושים?
    מתחילים באינדיבידואל.
    לכל אדם יש את התפריט התזונתי שיתאים לו בצורה המיטבית ביותר, אך הידיעה שגם התרגול שלנו צריך להתאים לנו בצורה המיטבית ביותר התפספס לאורך הדרך.
    אנחנו מאמינים בלשים את הצרכים והרצונות שלך בקדמה.
    זהו תהליך רפלקטיבי שהאינדיבידואל בוחן את התחומי עניין שלו ואת הדברים שמביאים לו אושר.
    בין אם אתה נמשך לווירטואוזיות של פארקור, לחינניות שבריקוד, לפעולות אקרובטיות עוצרות נשימה, למשמעת של אומנויות לחימה, האפשרויות מגוונות והן תלויות בך.
    הקהילה שלנו פה לתמוך בתהליך שלך למצוא את הייחודיות שלך ולוודא שזה יתיישר עם השאיפות והמטרות האישיות שלך.
    להתחיל תרגול תנועתי הוא לא השוואתי או תחרותי, הוא חגיגה שבה אנחנו מוצאים את הייחודיות שלנו.
    המפתח הוא להקשיב לגוף, לכבד את הגבולות שלו, ולהיות פתוחים לדחוף את עצמינו בהתאם למסגרות שלו, במרחב שמטפח את הדחיפה הזו.
    כל צעד כזה בתוך תרגול תנועה הוא צעד לכיוון גילוי-עצמי, צמיחה, והעצמה באינדיבידואל.
    אז איפה להתחיל? תתחיל בעצמך, ביחד עם קהילה תומכת שחוגגת את הייחודיות שלך.
    הצטרפו אלינו, ובואו נצעד יחד, כל אחד בדרכו שלו.`),
  },
]
