export type InnerPageKeys = 'about-me' | 'get-started' | 'culture';

export interface InnerPageConfig {
  pages: InnerPageKeys[];
}

export type InnerPage = {
  [key in InnerPageKeys]: {
    title: string;
    href: string;
    img: string;
    subtitle:string
    text:string
  };
};

export const innerPagesConfig: InnerPageConfig & InnerPage = {
  pages: ['about-me', 'culture' , 'get-started'],
  'about-me': {
    title: 'על עצמי',
    subtitle: `"אתה תמיד צריך להיות מוכן לכל סיטואציה,
    אבל אף פעם לא להתכונן אליה."`,
    href: '/about-me',
    img: '/imgs/12.webp',
    text:`אחד השיעורים הגדולים שתרגול תנועתי לימד אותי, ובתור מישהו שהתכונן לכל סיטואציה תמיד, מצאתי את עצמי בהרבה מקרים שאני לא באמת קשוב או נוכח להתפתחות שקורת מול עיני.
    במסעותיי הרבים אחרי העמקת הידע, מצאתי את עצמי נתקל במקרים שהאופציה היחידה היא לשחרר את השליטה, ולהצטרף לריקוד, כי אין דרך אחרת לחוות משהו חדש, אם אנחנו עדיין מלאים ברעיון ישן.
    בו-זמנית, אני מקבל באופן קבוע תזכורות שאם אני לא אטפח את השורשיות שלי, ואת היכולת שלי להיות מחובר לקרקע, אני ארחף במציאות הזו ללא שום דבר שיכווין אותי הלאה.
    שמי גיא יחזקאל, ואני מצאתי את עצמי שלם, כאשר אפשרתי לעצמי לרקוד עם שני העולמות.
    הכלי שמאפשר לי את זה הוא התרגול התנועתי,  שדואג ללמד אותי שאני לא יכול להישאר במקום אחד ולקוות לקצור את כל הפירות. 
    תתאמן על יותר מדי כוח? תהפוך לאדם נוקשה כי בנית לעצמך חומות פיזיות (ומטפוריות) למגן את עצמך, ולא להיות פתוח למה שעלול לבוא.
    תתאמן על אומנויות רכות יותר מדי? תביא את עצמך לחוסר יציבות, וחוסר יכולת לעמוד איתן (פיזית ומנטלית).
    וזהו המשחק התנועתי, אף פעם לא להישאר במקום מסוים, לטפח כל אחד מהם בצורה יסודית, ולתת לשני הצדדים של המטבע לצמוח ביחד מתוך הקשבה.
    אני מזמין אתכם להצטרף אליי לחקור את שני צדדי המטבע שבכם ולגלות עולמות דרך תנועה.
    `
  },
  'culture': {
      title: 'מהי תנועה',
      subtitle: `"מתחילים מאימון כוח? מתחילים מהעמוד שדרה? מתחילים מהחלמת פציעות?"`,
      href: '/culture',
      img: '/imgs/9.webp',
      text:`השאלה הגדולה ביותר, והשאלה שנשאלתי הכי הרבה פעמים.
      הרי אנחנו מנסים להבין, אנחנו רוצים לתת לזה תרגום בכדי שתהליך הלמידה יוכל לקחת מקום.
      אבל מה נעשה שהנחת יסוד משתנה? מה נעשה כשאי אפשר להבין?
      זה התחיל דיי פשוט, תנועה היה בשבילי תרגול של עבודת יכולות.
      יכולות שהתבטאו בלקפוץ על הידיים, ועוד תרגילי כוח לא "אופייניים".
      אבל רגע, יש עוד הרבה דברים שאינם קשורים ללקפוץ על היידים או לאימון כוח, שקשורים לתנועה,לא?
       מה לגביי פארקור? ריקוד? אומנויות לחימה? אקרובטיקה? תנועה בזוגות? 
      תנועה קבוצתית- משחקי ספורט? גלגולים? עבודת רצפה? תנועה רכה?
      האם כל אלה הם לא תרגול תנועתי?
      בוודאי שכן.
      רגע, אז אם אני אעשה את כל אלה, אוכל להגיד שאני מתאמן באימון תנועה.
      וכך עשיתי, במשך  שנים -יריתי לכל הכיוונים, בתקווה שכשאעשה *הכל* אוכל לקרוא לעצמי מתרגל, ומורה לתנועה, ואולי אי שם בסוף להגיד שאני מבין מה זה תנועה.
      אך שוב היוצרות התהפכו, כי עברתי שיעור חשוב מאוד.
      כי הסתבר לי שתנועה לא רק קורת בתרגול חיצוני-פיזי, תנועה קורת גם שאתה לא זז, מה שנקרא תנועה-פנימית.
      אני יכול לייחס את זה לתנועה של הזרם דם בגוף שלי, או של הרקמות שלי שנעות בסינרגיה עם שאר הגוף, או שאני יכול לייחס את זה לתנועת המחשבה שלי, האם גם זה הוא לא חלק מתנועה? הוא שם, הוא קיים, והוא משתנה, בדיוק כמו שאר האימונים.
      זהו? עכשיו הגעת להגדרה שלך?
      עדיין לא, הסתבר לי לאורך הזמן שיש משהו משותף ברמה מסוימת לכל אחד מהתרגולים, הם כולם רצוניים, אך האם יכולה להיות תנועה לא רצונית? האם הגוף יכול להזיז את עצמו מבלי שאנחנו נשפיע עליו, שהוא יעשה את מה שהוא עושה ויעביר אותנו תהליך החלמה?
      מסתבר שכן.
      וכאן, בנקודה הזו הגיעה נקודת מפנה בשבילי.
      לא כי הבנתי מה הוא תרגול תנועתי, כי הבנתי שאני לא יכול להבין.
      כי ברגע שאני שם את האצבע על משהו אחד, אני מסתיר את האחר, ואם אני מתעלם אפילו מחלק אחד בתמונה, אני לא רואה אותה בשלמותה, אז אולי רק אם אשחרר ואחליט לא להבין, אני אצליח לקבל תמונה.
      וזהו תרגול תנועתי בשבילי, חסר הגדרות ורעיונות, שממוקד באינדיבידואל חוקר, לא על מנת להגיע לתשובות, לא בשביל להגיע לפסגת ההר, אלא בשביל לצעוד בדרך ולהיות חלק מהמסע.
      `
  },
  'get-started': {
      title: 'איפה מתחילים',
      subtitle: `"מה נעשה שאי אפשר להבין?"`,
      href: '/get-started',
      img: '/imgs/16.webp',
      text:`הבעייתיות בתרגול שאיננו ניתן להגדרה כמו תרגול תנועתי, הוא שקשה להצביע על מה המקום שהכי טוב להתחיל ממנו.
      מתחילים מאימון כוח? מתחילים מהעמוד שדרה? מתחילים מהחלמת פציעות? מתחילים מהחלומות הכי פרועים שלנו? מבודדים ואז מחברים? מה עושים?
      מתחילים באינדיבידואל.
      לכל אדם יש את התפריט התזונתי שיתאים לו בצורה המיטבית ביותר, אך הידיעה שגם התרגול שלנו צריך להתאים לנו בצורה המיטבית ביותר התפספס לאורך הדרך.
      קיבלנו על עצמנו גזרות של מאמנים/מורים אחרים שאמרו לנו שזוהי הדרך.
      אבל אף אחד לא עצר לשאול את עצמו, האם זה הדרך שלו או הדרך שלי?
      האם הבנאדם שמולי מלמד אותי את הנקודות מבט שלו? האם אני רוצה ללמוד את הנקודות מבט שלו?
      מה אני רוצה?
      כל אלה הן שאלות קריטיות על מנת להבין איפה מתחילים, והאדם היחיד שיכול לענות עליהן הוא אתם.
      ישנו פתגם- "אדם שאומר לך שהוא יכול לגרום לך לחוות התעוררות רוחנית- זה כמו שהוא יגנוב לך את השעון שלך, וינסה למכור לך אותו". אותו דבר לגבי מאמנים/מורים.
      אז תתחילו בלשאול את עצמכם את השאלות האלה, שאלות שעד היום אחרי שנים של תרגול, אני עדיין שואל את עצמי, על בסיס יומ-יומי. מה אני רוצה?
      ואחרי ששאלתם את עצמכם את השאלות הללו, והתחלתם לגרד את השטח, תמצאו לכם משהו שאתם מרגישים שאתם יכולים לסמוך עליו. משהו שהולך בדרך בדיוק כמוכם.
      המשהו הזה לא יכפה עליכם אמת כלשהי, "השיטה שלי היא הטובה ביותר", או "הדרך שלי היא הדרך היחידה", אלא יהיה שם נטו בשבילכם, כמו ארגז כלים ותו לו.
      הוא יתן את מה שהוא יכול לתת, בלי פחדים, ובלי מחשבות, פשוט לתת.
      המטרה שלנו כמורים היא כמו של רופאים, לתת את כל מה שאנחנו יכולים לבנאדם שמולנו כדי שלא יפתח בי תלות, שהוא יפתח את העצמאות לחשוב בעצמו, ולא לחשוב מחשבות של אחרים.
      `
    },
    // 'contact': {
    //   title: 'יצירת קשר',
    //   subtitle: `"אני כאן ללוות אותך בכל צעד במסע שלך, ולהעניק לך את הכלים
    //                 לקידום אישי ותנועתי"`,
    //   href: '/contact',
    //   img: '/imgs/16.webp',
    // },
};
