
import AboutSection from "@/components/about-section"
import CardsSection from "@/components/cards-section"
import HeroSection from "@/components/hero"
import MentorshipSection from "@/components/mentorship-cta"
import TestimonialsSection from "@/components/testimonials-section"

const testimonials = [
  {
    image: "/images/1.webp",
    name: "אורי גולדשטיין",
    title: "מנהל חברה",
    text: 'לורם איפסום או בקיצור ליפסום הוא מלל מקובל וחסר משמעות המשמש "ממלא מקום" בעת עריכה, בתחום הדפוס, ההדפסה והפרסום. הטקסט משמש כלי לייצוג דפוס שאמור להתווסף למוצר הפרסום בעתיד. מדובר במלל ארוך במיוחד שניתן לבדוק עמו גופנים, וכן התאמת המלל לעמודים המעוצבים ובדיקת סוגי וגודלי גופן והתאמתם למוצר הסופי. '
  },
  {
    image: "/images/2.webp",
    name: 'יוסי פיין',
    title: 'לורם איפסום',
    text: 'לורם איפסום או בקיצור ליפסום הוא מלל מקובל וחסר משמעות המשמש "ממלא מקום" בעת עריכה, בתחום הדפוס, ההדפסה והפרסום. הטקסט משמש כלי לייצוג דפוס שאמור להתווסף למוצר הפרסום בעתיד. מדובר במלל ארוך במיוחד שניתן לבדוק עמו גופנים, וכן התאמת המלל לעמודים המעוצבים ובדיקת סוגי וגודלי גופן והתאמתם למוצר הסופי. '
  },
  {
    image: "/images/3.webp",
    name: 'איציק סאסא',
    title: 'לורם איפסום',
    text: 'לורם איפסום או בקיצור ליפסום הוא מלל מקובל וחסר משמעות המשמש "ממלא מקום" בעת עריכה, בתחום הדפוס, ההדפסה והפרסום. הטקסט משמש כלי לייצוג דפוס שאמור להתווסף למוצר הפרסום בעתיד. מדובר במלל ארוך במיוחד שניתן לבדוק עמו גופנים, וכן התאמת המלל לעמודים המעוצבים ובדיקת סוגי וגודלי גופן והתאמתם למוצר הסופי. '
  },
  {
    image: "/images/4.webp",
    name: 'יריב לוין',
    title: 'לורם איפסום',
    text: 'לורם איפסום או בקיצור ליפסום הוא מלל מקובל וחסר משמעות המשמש "ממלא מקום" בעת עריכה, בתחום הדפוס, ההדפסה והפרסום. הטקסט משמש כלי לייצוג דפוס שאמור להתווסף למוצר הפרסום בעתיד. מדובר במלל ארוך במיוחד שניתן לבדוק עמו גופנים, וכן התאמת המלל לעמודים המעוצבים ובדיקת סוגי וגודלי גופן והתאמתם למוצר הסופי. '
  },
  {
    image: "/images/5.webp",
    name: 'ביבי נתניהו',
    title: 'לורם איפסום',
    text: 'לורם איפסום או בקיצור ליפסום הוא מלל מקובל וחסר משמעות המשמש "ממלא מקום" בעת עריכה, בתחום הדפוס, ההדפסה והפרסום. הטקסט משמש כלי לייצוג דפוס שאמור להתווסף למוצר הפרסום בעתיד. מדובר במלל ארוך במיוחד שניתן לבדוק עמו גופנים, וכן התאמת המלל לעמודים המעוצבים ובדיקת סוגי וגודלי גופן והתאמתם למוצר הסופי. '
  }
]

export default function IndexPage() {
  return (
    <>
    <HeroSection />
    <AboutSection />
    <CardsSection />
    <MentorshipSection />
    <TestimonialsSection testimonials={testimonials}  />
    </>
  )
}